# %matplotlib inline
import random
from mxnet import autograd, np, npx
from d2l import mxnet as d2l

npx.set_np()

features = np.array([[-0.5159834,   0.92983335],
 [-0.670029,   -1.338948  ],
 [ 0.81066537, -1.0759466 ],
 [ 3.2393634,   1.2140454 ],
 [-0.17375311,  1.0864747 ],
 [-2.183919,   -0.7275137 ],
 [ 0.87849015, -0.23181568],
 [ 0.09838265,  1.0697416 ],
 [-0.13979793,  1.383972  ],
 [-1.4311374,  -0.1555236 ],
 [ 0.10718688,  0.81852245],
 [-0.41968602,  0.09074979],
 [-0.16568623, -0.03249694],
 [-0.7729327,   0.67501533],
 [-0.05185063,  0.60493904],
 [ 0.38341698,  0.00642719],
 [ 0.7473823,  -0.7866818 ],
 [ 0.33729932, -0.8118137 ],
 [-0.21472904,  0.04652686],
 [ 1.5709733,   0.5904677 ],
 [ 1.954929,    1.1150286 ],
 [ 0.12652962,  0.15183145],
 [ 1.7207557,   0.18549591],
 [ 0.16475123, -0.7160547 ],
 [ 1.6467025,   0.47056332],
 [ 0.8268269,  -0.7070982 ],
 [-0.8694941,  -1.0560691 ],
 [ 1.7063406,  -0.9477466 ],
 [ 0.31178275,  0.8504511 ],
 [ 1.0211121,   1.0529577 ],
 [-0.8248624,   0.35931566],
 [ 0.64533013,  0.8367705 ],
 [ 0.4083517,   0.7834252 ],
 [ 0.44832236,  0.11848761],
 [-0.12378476,  0.54308325],
 [ 1.2541351,  -2.4381423 ],
 [-0.04630265,  0.687505  ],
 [-0.72590554, -1.3990496 ],
 [ 0.6660236,   0.02083544],
 [-1.4259294,  -0.50480515],
 [ 0.00411734,  0.25180644],
 [ 1.80684,    -1.289493  ],
 [ 0.9483771,  -0.17311786],
 [-0.4508578,   0.8994366 ],
 [ 0.82915896,  0.6488344 ],
 [-0.695746,   -0.50074947],
 [ 0.10684528,  0.6433776 ],
 [ 1.9691621,  -0.38426766],
 [-1.2373735,   0.65715754],
 [ 1.1419603,   0.57600576],
 [-0.15492398, -0.5222454 ],
 [ 0.23586062, -1.2516292 ],
 [ 1.2271897,   0.12460999],
 [-0.10614841,  0.88295186],
 [-1.566059,    0.39479825],
 [ 0.6317479,   1.5616139 ],
 [-0.8573748,  -0.29841107],
 [-0.11418255,  3.107838  ],
 [ 0.6349026,   1.6973829 ],
 [-1.3680943,   1.4144186 ],
 [ 1.6859801,   0.46950573],
 [-2.3393998,  -0.47035372],
 [-0.5399567,   0.75226754],
 [ 1.9480963,  -1.2999465 ],
 [ 2.2096457,  -0.97236484],
 [ 3.123261,   -0.4997886 ],
 [ 0.41183168, -2.754864  ],
 [ 0.05047679,  0.469501  ],
 [-2.0389352,  -0.8780438 ],
 [ 0.8556523,   0.19987588],
 [-0.7035428,   0.37434307],
 [ 1.1678346,   1.1537147 ],
 [ 0.5446659,  -0.5329368 ],
 [-0.3072882,  -0.5170389 ],
 [ 0.24462366, -0.10786874],
 [ 0.5437688,   1.4840972 ],
 [ 0.55392027, -0.5990809 ],
 [-0.03365695, -0.3890281 ],
 [-0.92997694,  0.16721927],
 [ 1.3427633,  -0.57954913],
 [-0.48097795,  0.01484033],
 [-1.9501272,   1.1576264 ],
 [-0.36485338,  0.07733061],
 [ 0.29618275, -0.8773772 ],
 [-0.39435712, -0.2903069 ],
 [-1.5737125,   0.19200999],
 [ 1.525145,   -1.2331979 ],
 [-0.8783195,  -1.396172  ],
 [-0.8433714,  -0.08362636],
 [ 1.2785007,  -1.2031082 ],
 [ 2.158181,   -0.3388984 ],
 [-0.5202211,  -0.7630818 ],
 [ 0.55431074, -0.41472167],
 [-0.48968986,  0.90315735],
 [ 0.94664204, -1.7632351 ],
 [-0.7093023,   0.7337932 ],
 [ 2.0991862,  -0.4301286 ],
 [-1.0531203,  -0.70765805],
 [ 0.18759735,  0.87022394],
 [ 0.3293743,   1.5643092 ]])

labels = np.array([[ 5.4633589e-03],
 [ 7.4078660e+00],
 [ 9.4909506e+00],
 [ 6.5624614e+00],
 [ 1.6108997e-01],
 [ 2.3142550e+00],
 [ 6.7577014e+00],
 [ 7.6113534e-01],
 [-7.6812577e-01],
 [ 1.8686912e+00],
 [ 1.6455431e+00],
 [ 3.0587025e+00],
 [ 3.9910049e+00],
 [ 3.6774793e-01],
 [ 2.0491688e+00],
 [ 4.9326973e+00],
 [ 8.3639002e+00],
 [ 7.6270065e+00],
 [ 3.6091332e+00],
 [ 5.3445091e+00],
 [ 4.3069839e+00],
 [ 3.9430819e+00],
 [ 7.0267491e+00],
 [ 6.9706726e+00],
 [ 5.8838716e+00],
 [ 8.2656765e+00],
 [ 6.0486584e+00],
 [ 1.0839763e+01],
 [ 1.9289751e+00],
 [ 2.6494203e+00],
 [ 1.3261226e+00],
 [ 2.6399860e+00],
 [ 2.3419476e+00],
 [ 4.6928425e+00],
 [ 2.1072273e+00],
 [ 1.5013187e+01],
 [ 1.7639562e+00],
 [ 7.5022244e+00],
 [ 5.4645877e+00],
 [ 3.0661273e+00],
 [ 3.3534997e+00],
 [ 1.2206524e+01],
 [ 6.6909304e+00],
 [ 2.4744987e-01],
 [ 3.6611595e+00],
 [ 4.4952979e+00],
 [ 2.2370312e+00],
 [ 9.4528589e+00],
 [-5.1754904e-01],
 [ 4.5009971e+00],
 [ 5.6655121e+00],
 [ 8.9388618e+00],
 [ 6.2219367e+00],
 [ 9.9232548e-01],
 [-2.7387103e-01],
 [ 1.6079573e-01],
 [ 3.5050757e+00],
 [-6.5712647e+00],
 [-3.0699959e-01],
 [-3.3416939e+00],
 [ 5.9634895e+00],
 [ 1.1353658e+00],
 [ 5.6704009e-01],
 [ 1.2516060e+01],
 [ 1.1938952e+01],
 [ 1.2139145e+01],
 [ 1.4386744e+01],
 [ 2.7070546e+00],
 [ 3.1171932e+00],
 [ 5.2331114e+00],
 [ 1.5271419e+00],
 [ 2.6040654e+00],
 [ 7.1027699e+00],
 [ 5.3477788e+00],
 [ 5.0480003e+00],
 [ 2.4852210e-01],
 [ 7.3499088e+00],
 [ 5.4637737e+00],
 [ 1.7727431e+00],
 [ 8.8779335e+00],
 [ 3.1972902e+00],
 [-3.6374848e+00],
 [ 3.2209258e+00],
 [ 7.7736721e+00],
 [ 4.4022703e+00],
 [ 4.0114981e-01],
 [ 1.1446336e+01],
 [ 7.2053432e+00],
 [ 2.8087525e+00],
 [ 1.0862238e+01],
 [ 9.6701860e+00],
 [ 5.7557578e+00],
 [ 6.7150116e+00],
 [ 1.4172034e-01],
 [ 1.2083435e+01],
 [ 2.8255299e-01],
 [ 9.8757372e+00],
 [ 4.5107713e+00],
 [ 1.6029654e+00],
 [-4.4925308e-01]])

# 线性回归模型: y = Xw + b + e
# 数据生成，
def synthetic_data(w, b, num_examples):
    X = np.random.normal(0, 1, (num_examples, len(w)))
    y = np.dot(X, w) + b
    y += np.random.normal(0, 0.01, y.shape)
    return X, y.reshape((-1, 1))

# 权重
true_w = np.array([2, -3.4])
true_b = 4.2
# features, labels = synthetic_data(true_w, true_b, 1000)

# print('features:', features[0], '\nlabel:', labels[0])
# print('features:', features)
# print('label:', labels)

d2l.set_figsize()
d2l.plt.scatter(features[:, (1)].asnumpy(), labels.asnumpy(), 1)
# d2l.plt.scatter(features[:, (0)].asnumpy(), labels.asnumpy(), 1)

# 生成小批量训练数据
def data_iter(batch_size, features, labels):
    # 获取样本数量并随机打乱索引
    num_examples = len(features)
    indices = list(range(num_examples))
    # random.shuffle(indices)
    for i in range(0, num_examples, batch_size):
        # 将要返回的索引
        batch_indices = np.array(
                indices[i : min(i + batch_size, num_examples)])
        # print(features)
        # print(labels)
        # print(batch_indices)
        # 暂停并返回, 下次可继续运行
        yield features[batch_indices], labels[batch_indices]

# 定义模型y = Xw + b
def linreg(X, w, b):
    return np.dot(X, w) + b

# 定义损失函数, 使用平方损失函数
# 期望值与真实值的平方差, /2为了简化求导
def squared_loss(y_hat, y):
    return (y_hat - y.reshape(y_hat.shape)) ** 2 / 2

# 定义优化算法, 通过调整模型参数使损失变小，最小化损失找到最优参数
# 可以用解析解（条件太限制），这里用梯度下降法: 每次迭代在负梯度的方向上更新参数
# 负梯度方向 几何意义：
# 梯度指向函数值局部增长最快的方向, 在当前位置，沿此方向移动一小步，函数值会减少最多。
# lr是学习率，batch_size是样本大小
def sgd(params, lr, batch_size):
    for param in params:
        param[:] = param - lr * param.grad / batch_size

# 训练，在每次迭代中，我们读取一小批量训练样本，并通过我们的模型来获得一组预测。
# 计算完损失后，我们开始反向传播，存储每个参数的梯度。 最后，我们调用优化算法sgd来更新模型参数
# 一个迭代周期内遍历了整个数据集，但每次迭代是一个小批量样本

# 初始化模型参数权重w和偏置b
w = np.random.normal(0, 0.01, (2, 1))
b = np.zeros(1)
# 用于自动微分和储存梯度
w.attach_grad()
b.attach_grad()

batch_size = 10
lr = 0.03
num_epochs = 1
net = linreg
loss = squared_loss

for epoch in range(num_epochs):
    for X, y in data_iter(batch_size, features, labels):
        with autograd.record():
            # X和y的小批量损失
            l = loss(net(X, w, b), y)
            print(f'loss.shap: {l.shape} data: {l}')
        # 计算关于[w,b]的梯度
        l.backward()
        print(X)
        print(y)
        # print(f'loss.shap: {l.shape} data: {l}')
        print(f'w.grad.shap: {w.grad.shape} data: {w.grad}')
        # 使用参数的梯度更新参数
        sgd([w, b], lr, batch_size)
        break
    train_l = loss(net(features, w, b), labels)
    print(f'epoch {epoch + 1}, loss {float(train_l.mean()):f}')

print(f'w的估计误差: {true_w - w.reshape(true_w.shape)}')
print(f'b的估计误差：{true_b - b}')

t_x = np.array([[1, 2], [3, 4], [5, 6]])
t_w = np.array([0.3, 0.7])
t_x.attach_grad()
t_w.attach_grad()
print(t_x.shape)
print(t_w.shape)
with autograd.record():
    y = np.dot(t_x, t_w)
    print(y)
    print(y.sum())
y.backward()
print(f't_x.grad.shap: {t_x.grad.shape} data: {t_x.grad}')
print(f't_w.grad.shap: {t_w.grad.shape} data: {t_w.grad}')

# test
# for X, y in data_iter(batch_size, features, labels):
#     print(X, '\n', y)
#     break
